БИТУправление_медицинским_центром_демо/src/Documents/КомплексныйРасчетКлиента/КомплексныйРасчетКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КомплексныйРасчетКлиента</name>
  <registerRecords>AccumulationRegister.НоменклатураКомплексныхРасчетовКлиентов</registerRecords>
  <registerRecords>AccumulationRegister.ВыработкаСотрудников</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровНаСкладах</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыКомплексныхРасчетовКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Прейскурант</name>
    <type>
      <types>CatalogRef.Прейскуранты</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Остановлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимыйДолг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Прием</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентАванса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИгнорироватьДолг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСоСкидкой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИгнорироватьДолг</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сырье</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Спецификация</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>CatalogRef.ПараметрыСпецификаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДобавленАвтоматически</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиСортировки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыРабот</name>
    <attributes>
      <name>ИдентификаторЭтапа</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторСтрокой</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсполнительПлан</name>
      <type>
        <types>DefinedType.ИсполнителиЭтаповКомплексногоРасчета</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/CommonModules/КомплексныеРасчетыКлиентовКлиент/Module.bsl
#Область ПрограммныйИнтерфейс

// Открывает форму подбора в документ из комплексного расчета
//
// Параметры:
//  КомплексныйРасчет	 - ДокументСсылка.ОказаниеУслуг.КомплексныйРасчет - комплексный расчет
//  ПозицииПриемника	 - КоллекцияЗначений - коллекция строк работ, товаров и т.д. документа, в который делается подбор позиций
//  ПриемникСсылка		 - ДокументСсылка - ссылка на документ, в который делается подбор
//  ФормаВладелец		 - Объект - форма владелец
//  РежимВозврат		 - Булево - режим возврата
//
Процедура ОткрытьПодборИзКомплексногоРасчетаКлиента(КомплексныйРасчет, ПозицииПриемника, ПриемникСсылка, ФормаВладелец = Неопределено, РежимВозврат = Ложь) Экспорт
	
	ОткрытьФорму("Документ.КомплексныйРасчетКлиента.Форма.ФормаПодбораПозицийПоДокументу", 
				 Новый Структура("КомплексныйРасчет, ПозицииПриемника, ПриемникСсылка, РежимВозврат", КомплексныйРасчет, ПозицииПриемника, ПриемникСсылка, РежимВозврат),
				 ФормаВладелец);
	
КонецПроцедуры
			 
// Собирает из документа, в который будет подбор, те позиции, которые в нём уже есть.
//
// Параметры:
//  Объект	 - ДокументОбъект.ОказаниеУслуг, ДокументОбъект.Прием - документ для побора из копмлексного расчета.
// 
// Возвращаемое значение:
//   Массив.
//
Функция ПолучитьВФормеПозицииДокументаДляПодбораИзКомплексногоРасчета(Объект) Экспорт
	
	Перем Результат;
	
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ОказаниеУслуг") Тогда
		
		Результат = Новый Массив;
		мсТЧ = Новый Структура("Работы, Товары, Материалы");
		
		Для Каждого кзТЧ Из мсТЧ Цикл
			Для Каждого СтрокаТЧ Из Объект[кзТЧ.Ключ] Цикл
				СтруктураСтроки = ПолучитьСтруктуруПозицииДокументаВызоваПодбораИзКомплексногоРасчета();
				ЗаполнитьЗначенияСвойств(СтруктураСтроки, СтрокаТЧ);
				Результат.Добавить(СтруктураСтроки);
			КонецЦикла;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.Прием") Тогда
		
		Результат = Новый Массив;
		// Материалы? ***.
		Для Каждого СтрокаТЧ Из Объект.Работы Цикл
			СтруктураСтроки = ПолучитьСтруктуруПозицииДокументаВызоваПодбораИзКомплексногоРасчета();
			ЗаполнитьЗначенияСвойств(СтруктураСтроки, СтрокаТЧ);
			Результат.Добавить(СтруктураСтроки);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#Область ОбработчикиСобытийТаблицыЭтаповРабот

// Функция - Этапы работ выполнен при изменении
//
// Параметры:
//  СтрокаЭтапа	 - Элементы.ЭтапыРабот.ТекущиеДанные - строка этапа
// 
// Возвращаемое значение:
//  Отсутствует 
//
Функция ЭтапыРаботВыполненПриИзменении(СтрокаЭтапа) Экспорт
	
	СтрокаЭтапа.ОтметкаВыполнения = ЗначениеЗаполнено(СтрокаЭтапа.Выполнен);
	СтрокаЭтапа.ВыполненВЭтомДокументе = СтрокаЭтапа.ОтметкаВыполнения;
	
	СтрокаЭтапа.Пользователь = ?(СтрокаЭтапа.ОтметкаВыполнения, Пользователи.ТекущийПользователь(), Неопределено);
	СтрокаЭтапа.ИсполнительФакт = ?(СтрокаЭтапа.ОтметкаВыполнения, СтрокаЭтапа.ИсполнительПлан, Неопределено);	
		
КонецФункции

// Функция - Этапы работ отметка выполнения при изменении
//
// Параметры:
//  СтрокаЭтапа	 - Элементы.ЭтапыРабот.ТекущиеДанные - строка этапа
// 
// Возвращаемое значение:
//  Отсутствует 
//
Функция ЭтапыРаботОтметкаВыполненияПриИзменении(СтрокаЭтапа) Экспорт
	
	СтрокаЭтапа.ВыполненВЭтомДокументе = СтрокаЭтапа.ОтметкаВыполнения;
	СтрокаЭтапа.Выполнен = ?(СтрокаЭтапа.ОтметкаВыполнения, ТекущаяДата(), Дата(1,1,1));
	
	СтрокаЭтапа.Пользователь = ?(СтрокаЭтапа.ОтметкаВыполнения, Пользователи.ТекущийПользователь(), Неопределено);
	СтрокаЭтапа.ИсполнительФакт = ?(СтрокаЭтапа.ОтметкаВыполнения, СтрокаЭтапа.ИсполнительПлан, Неопределено);	

	ЭтапыРаботУстановитьТипИсполнителя(СтрокаЭтапа);
	
КонецФункции

// Процедура - Этапы работ установить тип исполнителя
//
// Параметры:
//  СтрокаЭтапа	 - Элементы.ЭтапыРабот.ТекущиеДанные - строка этапа
//
Процедура ЭтапыРаботУстановитьТипИсполнителя(СтрокаЭтапа) Экспорт 
	
	ТипИсполнителя = Новый ОписаниеТипов(?(СтрокаЭтапа.ВнешнийИсполнитель, 
		"СправочникСсылка.Контрагенты", "СправочникСсылка.Сотрудники"));
	СтрокаЭтапа.ИсполнительПлан = ТипИсполнителя.ПривестиЗначение(СтрокаЭтапа.ИсполнительПлан);
	СтрокаЭтапа.ИсполнительФакт = ТипИсполнителя.ПривестиЗначение(СтрокаЭтапа.ИсполнительФакт);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Позволяет получить структуру позиции документа для вызова подбора из комплексного расчета
// 
// Возвращаемое значение:
//	Структура.
//
Функция ПолучитьСтруктуруПозицииДокументаВызоваПодбораИзКомплексногоРасчета() Экспорт
	Возврат Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, Цена, ЕдиницаИзмерения, Количество")
КонецФункции

#КонецОбласти
